demo-output/website/dafoam/f6a_epistemic_band/r4_band_tightening_hump/oneC_delta0.10/0/Cz
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
51626
(
2.17492e-05
2.17492e-05
2.17492e-05
2.17492e-05
2.17492e-05
2.17492e-05
2.17492e-05
2.17492e-05
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
83
(
2.17492e-05
6.73557e-05
0.00011738
0.000172242
0.000232402
0.000298361
0.000370666
0.000449913
...
)
;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
622
(
-6.53423e-18
-6.53423e-18
-6.53423e-18
-6.53423e-18
-6.53423e-18
-6.53423e-18
-6.53423e-18
-6.53423e-18
...
)
;
    }
    sides
    {
        type            empty;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
83
(
2.04138e-05
6.12413e-05
0.000102069
0.000142896
0.000183724
0.000224551
0.000266067
0.000311961
...
)
;
    }
    top
    {
        type            symmetry;
    }
}


// ************************************************************************* //
