demo-output/website/dafoam/f6a_epistemic_band/r4_band_tightening_hump/oneC_delta0.10/0/inletOutletFields/omega_inlet
omega_inlet nonuniform List<scalar>
83
(
6596244.579129838
1883524.5659219793
789867.6815135228
312776.9087132564
143063.7061191072
80815.16732925294
53458.287728365634
38752.16174580681
...
);
