demo-output/website/dafoam/f6a_epistemic_band/r4_band_tightening_hump/oneC_delta0.10/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

#include "../caseDef"
#include "inletOutletFields/omega_inlet"

internalField   uniform $omegaRef;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $omega_inlet;
    }

    bottom
    {
        type            omegaWallFunction;
        value           uniform 1e10;
    }
    
    outlet
    {
        type            zeroGradient;
    }
    
    sides
    {
        type            empty;
    }
    
    top
    {
        type            symmetry;
    }

}

// ************************************************************************* //
