demo-output/website/dafoam/f6a_epistemic_band/r4_band_tightening_hump/oneC_delta0.10/system/convergenceProbes
#include "../caseDef"
#include "../fieldDef"

//y-coordinate in the middle of the domain
yMid #calc "-0.5*$c";

//Start of hump
xHumpStart #calc "0.0335*$c";
zHumpStart #calc "0.0263*$c";

//High speed region above hump
xHighSpeed #calc "0.524*$c";
zHighSpeed #calc "0.178*$c";

//Detachment region
xDetach #calc "0.671*$c";
zDetach #calc "0.111*$c";

//Reattachment region
xReattach #calc "1.25*$c";
zReattach #calc "0.00281*$c";


convergenceProbes
{
    // Where to load it from
    libs            ("libsampling.so");

    type            probes;

    // Name of the directory for probe data
    name            convergenceProbes;

    // Write at same frequency as fields
    writeControl    timeStep;
    writeInterval   1;

    // Fields to be probed
    fields          $convergenceFields;

    probeLocations
    (
        ($xHumpStart $yMid $zHumpStart) //Start of hump
        ($xHighSpeed $yMid $zHighSpeed) //High speed region above hump
        ($xDetach $yMid $zDetach) //Detachment region
        ($xReattach $yMid $zReattach) //Reattachment region
    );
}
